app/controllers/championships_controller.rb

  def manage_equipe
    @championship = Championship.find_by_id(params[:championship_id]) || Championship.find_by_id(params[:id])

    if request.post?
      @championship.attributes = params[:championship]
      if @championship.associate_equipe
        flash[:notice] = "Associação de Equipe para o Campeonato realizada com sucesso!"
        redirect_to(@championship)
      end
    end

    if request.delete?
      @championship.equipes.delete(Equipe.find(params[:equipe_id]))
---
SELECT * FROM "championships" WHERE ("championships"."id" IS NULL) LIMIT 1
SELECT "equipes".id FROM "equipes" INNER JOIN "equipes_championships" ON "equipes".id = "equipes_championships".equipe_id WHERE ("equipes"."id" = 2) AND ("equipes_championships".championship_id = 1 ) LIMIT 1