app/controllers/equipes_controller.rb

  def associate
    @group = Group.find_by_id(params[:group_id]) || Group.find_by_id(params[:id])
    @championship = @group.championship

    if request.post?
      @group.attributes = params[:group]
      if @group.associate_equipe
        flash[:notice] = "Associação de Equipe realizada com sucesso!"
        redirect_to([@championship, @group])
      end
    end

    if request.delete?
      @group.equipes.delete(Equipe.find(params[:equipe_id]))
---
SELECT * FROM "groups" WHERE ("groups"."id" IS NULL) LIMIT 1
SELECT "equipes".id FROM "equipes" INNER JOIN "equipes_groups" ON "equipes".id = "equipes_groups".equipe_id WHERE ("equipes"."id" = 2) AND ("equipes_groups".group_id = 1 ) LIMIT 1
SELECT * FROM "championships" WHERE ("championships"."id" = 1)